'''
Виведіть площу виділеного червоним трикутника.

1) Запросіть два числа a і b - сторони прямокутника.
2) Зверніть увагу: площа червоного трикутника дорівнює половині площі намальованого прямокутника!
Відповідь має відповідати формату виведення, як вказано в прикладі. 
Формула знаходження площі  прямокутника S = a * b.
'''
num1 = input("Вкажіть першу сторону прямокутника: ")
num2 = input("Вкажіть другу сторону прямокутника: ")
s = (int(num1) * int(num2))/2
print(f"Площа червоного трикутника = {s}.")