'''
Вільний діалог

Вільне завдання: вигадайте свою програму, яка задає питання і коментує відповіді.
Можна, наприклад, написати програму-анкету, яка запитує дані людини: ім'я, прізвище, вік, улюблені колір 
і страву і т. д., а потім друкує табличку типу 
"Ім'я: (ім'я людини)". 
"Прізвище: (введене прізвище)" 
і т. д.            
                                                                                  
А можна придумати смішний діалог. 
Запропонуйте друзям поговорити з цією програмою!
'''
name = input("Як вас звати?")
surname = input("Яке ваше прізвище?")
age = input("Скільки вам років?")
color = input("Який ваш улюблений колір?")
meal = input("Яка ваша улюблена страва?")
married = input("Ви одружені/заміжні?")
workout = input("Ви займаєтесь спортом?")

print("""
      Ім'я : %s 
      Прізвище : %s 
      Вік : %s 
      Улюблений колір : %s 
      Улюблена страва : %s 
      Одружений/заміжня : %s 
      Займається спортом : %s""" % (name, surname, age, color, meal, married, workout))
    
